---
kind: property
id: P:Autodesk.Revit.DB.ComponentRepeaterIterator.CurrentObject
source: html/c3c6e171-ed0a-55b3-13e4-4eec75536b5f.htm
---
# Autodesk.Revit.DB.ComponentRepeaterIterator.CurrentObject Property

## Syntax (C#)
```csharp
internal Object CurrentObject { get; }
```